app/views/users/show.html.erb

SELECT 1 AS one FROM `microposts` WHERE `microposts`.`user_id` = 1 LIMIT 1
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 3
---
    <%= render 'follow_form' if logged_in? %>
    <% if @user.microposts.any? %>
      <h3>Microposts (<%= @user.microposts.count %>)</h3>