app/controllers/comments_controller.rb

  def create
    @comment = Comment.create! comment_params
---
INSERT INTO `comments` (`body`, `user_id`, `micropost_id`, `post_parent_id`, `created_at`, `updated_at`) VALUES ('ádasd', 2, 5, NULL, '2022-11-21 08:51:10.700295', '2022-11-21 08:51:10.700295')