app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    @micropost.image.attach(params[:micropost][:image])
    if @micropost.save
      flash[:success] = 'Micropost created!'
      redirect_to root_url
    else
      @feed_items = current_user.feed.paginate(page: params[:page])
---
INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`) VALUES ('dit con mẹ\r\n', 3, '2022-11-19 13:18:22.856679', '2022-11-19 13:18:22.856679')
SELECT COUNT(*) FROM `microposts` LEFT OUTER JOIN `users` ON `users`.`id` = `microposts`.`user_id` LEFT OUTER JOIN `relationships` ON `relationships`.`followed_id` = `users`.`id` LEFT OUTER JOIN `users` `followers_users` ON `followers_users`.`id` = `relationships`.`follower_id` WHERE (relationships.follower_id = '3' or microposts.user_id = '3')
SELECT `microposts`.* FROM `microposts` LEFT OUTER JOIN `users` ON `users`.`id` = `microposts`.`user_id` LEFT OUTER JOIN `relationships` ON `relationships`.`followed_id` = `users`.`id` LEFT OUTER JOIN `users` `followers_users` ON `followers_users`.`id` = `relationships`.`follower_id` WHERE (relationships.follower_id = '3' or microposts.user_id = '3') ORDER BY `microposts`.`created_at` DESC LIMIT 30 OFFSET 0

  def destroy
    @micropost.destroy
---
DELETE FROM `microposts` WHERE `microposts`.`id` = 3

  def correct_user
    @micropost = current_user.microposts.find_by(id: params[:id])
---
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 3 AND `microposts`.`id` = 3 ORDER BY `microposts`.`created_at` DESC LIMIT 1