app/controllers/static_pages_controller.rb

  def home
    return unless logged_in?

    @micropost = current_user.microposts.build
    @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT COUNT(*) FROM `microposts` LEFT OUTER JOIN `users` ON `users`.`id` = `microposts`.`user_id` LEFT OUTER JOIN `relationships` ON `relationships`.`followed_id` = `users`.`id` LEFT OUTER JOIN `users` `followers_users` ON `followers_users`.`id` = `relationships`.`follower_id` WHERE (relationships.follower_id = '3' or microposts.user_id = '3')
SELECT `microposts`.* FROM `microposts` LEFT OUTER JOIN `users` ON `users`.`id` = `microposts`.`user_id` LEFT OUTER JOIN `relationships` ON `relationships`.`followed_id` = `users`.`id` LEFT OUTER JOIN `users` `followers_users` ON `followers_users`.`id` = `relationships`.`follower_id` WHERE (relationships.follower_id = '3' or microposts.user_id = '3') ORDER BY `microposts`.`created_at` DESC LIMIT 30 OFFSET 0