app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    # redirect_to root_url and return unless FILL_IN    ?????????
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 3
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 3 ORDER BY `microposts`.`created_at` DESC LIMIT 30 OFFSET 0

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `remember_digest`, `admin`, `activation_digest`, `activated`, `activated_at`, `reset_digest`, `reset_sent_at`, `encrypted_password`, `uid`, `avatar_url`, `provider`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`) VALUES ('Nguyen Trong Nghia', 'admin@gmail.com', '2022-11-19 12:34:06.627176', '2022-11-19 12:34:06.627176', NULL, NULL, NULL, '$2a$12$RcDvSEEGWhXtkWcmxl8GH.2SOxETfJv1OdjD5/jPEMNf1K2pAcFXO', FALSE, NULL, NULL, NULL, '$2a$12$0lYt6LzxXjA1rlQtPShtd.pj.kKsj6YXywke34OH9kWrJNQdfrIIm', NULL, NULL, NULL, NULL, NULL, NULL)

  def index
    # @users = User.all.paginate(page: params[:page])
    @users = User.where(activated: true).paginate(page: params[:page])
---
SELECT `users`.* FROM `users` WHERE `users`.`activated` = TRUE LIMIT 30 OFFSET 0

  def following
    @title = 'Following'
    @user = User.find(params[:id])
    @users = @user.following.paginate(page: params[:page])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def followers
    @title = 'Followers'
    @user = User.find(params[:id])
    @users = @user.followers.paginate(page: params[:page])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def correct_user
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1