app/models/user.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `remember_digest`, `admin`, `activation_digest`, `activated`, `activated_at`, `reset_digest`, `reset_sent_at`, `encrypted_password`, `uid`, `avatar_url`, `provider`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`) VALUES ('Nghĩa Nguyễn', 'nguyentrongnghia25201@gmail.com', '2022-11-21 07:12:33.190679', '2022-11-21 07:12:33.190679', NULL, NULL, NULL, '$2a$12$2qYLjCxjEaPcL5pdozrgS.v8EVpT2iedJM45qpkBftIZ/oiaG952K', FALSE, NULL, NULL, NULL, '$2a$12$38OKVlFH0YxQKEn.fWssPe0VOk7m4CeNjtvkt1Im8J1ElX4pYMM1q', '113844718040794188224', NULL, 'google_oauth2', NULL, NULL, NULL)
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'google_oauth2' AND `users`.`uid` = '113844718040794188224' ORDER BY `users`.`id` ASC LIMIT 1
---
  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|